import { splitIntoSentencesSimpleUr } from "./sentence-split-ur.util";
import { expect, describe, it } from "bun:test";

describe("splitIntoSentencesSimpleUr", () => {
  it("expect to 1 sentences", () => {
    const input = `جدید معاشرے میں کام اور زندگی کو متوازن کرنا ایک مستقل چیلنج ہے ، اور اس میں کوئی ایک سائز کے فٹ بیٹھ نہیں ہے۔ عام طور پر ، لوگ حکمت عملی کے امتزاج کے ذریعہ اس توازن کو حاصل کرتے ہیں۔ او .ل ، موثر وقت کا انتظام بہت ضروری ہے - حدود طے کرنا ، کاموں کو ترجیح دینا ، اور ضرورت سے زیادہ مطالبات کو نہیں کہنا سیکھنا۔ دوم ، بہت سے لوگ کام سے باقاعدہ 'ان پلگنگ' کرنے کے لئے وکالت کرتے ہیں ، خاص وقت کی سلاٹوں کو کنبہ ، شوق ، یا ذاتی فلاح و بہبود کے لئے وقف کرتے ہیں۔ اس میں سخت غیر ای میل کے اوقات کا تعین کرنا یا ڈیجیٹل ڈیٹوکس لینا شامل ہوسکتا ہے۔ تیسرا ، کمپنیاں اور افراد لچکدار کام کرنے والے انتظامات کی اہمیت کو تیزی سے پہچان رہے ہیں ، جیسے ریموٹ ورک یا کمپریسڈ ورک ویک ، جو کسی کے شیڈول پر زیادہ کنٹرول پیش کرسکتے ہیں۔ آخر کار ، یہ اکثر شعوری انتخاب ، کسی کی توانائی کی سطح کے بارے میں خود آگاہی ، اور پیشہ ورانہ کامیابیوں سے باہر واقعی تکمیل کو کیا لاتا ہے اس کی واضح تفہیم پر آتا ہے۔`;
    expect(splitIntoSentencesSimpleUr(input).length).toEqual(7);
  });
  it("expect to 2 sentences", () => {
    const input = `آج کل، سیل فون ہمارے دماغ کا توسیعی حصہ بن گئے ہیں، کیا ایسا نہیں؟ لوگ ان پر انحصار کرتے ہیں کیونکہ یہ بہت سہولت بخش ہیں—یاد دہانیوں، کیلنڈرز، یا نوٹس کے لیے ایپس کی بدولت معلومات کو ذخیرہ کرنا آسان ہو جاتا ہے بغیر ہمارے دماغ کو بھرے۔`;
    expect(splitIntoSentencesSimpleUr(input).length).toEqual(2);
  });
  
});